6.1

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("examples/ex1.csv")

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
pd.read_csv('examples/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
pd.read_csv('examples/ex2.csv',names=["a","b","c","d","message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
names=["a","b","c","d","message"]

In [10]:
pd.read_csv('examples/ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [12]:
parsed = pd.read_csv('examples/csv_mindex.csv',index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [13]:
result = pd.read_csv('examples/ex5.csv',na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [14]:
pd.options.display.max_rows = 10

In [15]:
result = pd.read_csv('examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

6.2

In [16]:
frame = pd.read_csv('examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
frame.to_pickle('examples/frame_pickle')

In [18]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
pip install openpyxl xlrd

Requirement already satisfied: openpyxl in /Users/uyakut/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (3.1.5)
Requirement already satisfied: xlrd in /Users/uyakut/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (2.0.1)
Requirement already satisfied: et-xmlfile in /Users/uyakut/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

In [20]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [21]:
xlsx

In [22]:
xlsx.sheet_names

['Sheet1']

In [23]:
xlsx.parse(sheet_name='Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [24]:
xlsx.parse(sheet_name='Sheet1',index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

6.3

In [25]:
pip install requests

Requirement already satisfied: requests in /Users/uyakut/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (2.32.3)
Requirement already satisfied: charset-normalizer<4,>=2 in /Users/uyakut/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from requests) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in /Users/uyakut/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from requests) (3.8)
Requirement already satisfied: urllib3<3,>=1.21.1 in /Users/uyakut/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from requests) (2.2.2)
Requirement already satisfied: certifi>=2017.4.17 in /Users/uyakut/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from requests) (2024.7.4)
Note: you may need to restart the kernel to use updated packages.

In [26]:
import requests
url = "https://api.github.com/repos/pandas-dev/pandas/issues"
resp = requests.get(url)

In [27]:
resp.raise_for_status()

In [28]:
resp

In [29]:
data = resp.json()

In [30]:
data[0]['title']

'DOC: Fix docstrings errors SEM and GET_GROUP'

6.4

In [31]:
import sqlite3

In [32]:
query = """
   .....: CREATE TABLE test
   .....: (a VARCHAR(20), b VARCHAR(20),
   .....:  c REAL,        d INTEGER
   .....: );"""

In [33]:
con = sqlite3.connect("mydata.sqlite")

In [35]:
con.execute(query)

OperationalError: table test already exists

In [36]:
con.commit()

In [37]:
data = [("Atlanta", "Georgia", 1.25, 6),
   .....:         ("Tallahassee", "Florida", 2.6, 3),
   .....:         ("Sacramento", "California", 1.7, 5)]

In [38]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [39]:
con.executemany(stmt, data)

In [40]:
con.commit()

In [41]:
cursor = con.execute("SELECT * FROM test")

In [42]:
rows = cursor.fetchall()

In [43]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [44]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [45]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/uyakut/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (2.0.36)
Requirement already satisfied: typing-extensions>=4.6.0 in /Users/uyakut/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from sqlalchemy) (4.12.2)
Note: you may need to restart the kernel to use updated packages.

In [46]:
import sqlalchemy as sqla

In [47]:
db = sqla.create_engine("sqlite:///mydata.sqlite")

In [48]:
pd.read_sql("SELECT * FROM test", db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5

7.1

In [49]:
data = pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [50]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [51]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))

In [52]:
df

          0         1         2
0 -0.852384  1.103474 -1.670551
1 -1.454898  0.288656  1.435089
2  0.575384  0.124359 -2.232928
3 -1.065809  0.418088 -0.683084
4  0.675562  0.718016  2.255074
5 -0.241602  1.272487 -0.091320
6  0.033202  0.044329  0.279936

In [53]:
df.iloc[:4, 1] = np.nan

In [54]:
df

          0         1         2
0 -0.852384       NaN -1.670551
1 -1.454898       NaN  1.435089
2  0.575384       NaN -2.232928
3 -1.065809       NaN -0.683084
4  0.675562  0.718016  2.255074
5 -0.241602  1.272487 -0.091320
6  0.033202  0.044329  0.279936

In [55]:
df.dropna()

          0         1         2
4  0.675562  0.718016  2.255074
5 -0.241602  1.272487 -0.091320
6  0.033202  0.044329  0.279936

In [56]:
df

          0         1         2
0 -0.852384       NaN -1.670551
1 -1.454898       NaN  1.435089
2  0.575384       NaN -2.232928
3 -1.065809       NaN -0.683084
4  0.675562  0.718016  2.255074
5 -0.241602  1.272487 -0.091320
6  0.033202  0.044329  0.279936

7.2

In [57]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],"k2": [1, 1, 2, 3, 3, 4, 4]})

In [58]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [59]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [60]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [61]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon","pastrami", "corned beef", "bacon","pastrami", "honey ham", "nova lox"],"ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [62]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [63]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [64]:
data["animal"] = data["food"].map(meat_to_animal)

In [65]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [66]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [67]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.028016     0.011113    -0.042963    -0.033759
std       1.051990     0.990656     1.001243     1.034015
min      -3.695076    -3.386881    -3.142960    -3.244744
25%      -0.753275    -0.681736    -0.724981    -0.708132
50%       0.020739     0.034340    -0.018276     0.030129
75%       0.720263     0.706183     0.662327     0.664033
max       3.115935     3.015691     2.551450     3.366091